review/semantic-kernel/honest-gate/implementation/grok-clean-closeout-r2/execution/want-rc0-mutant/want-rc0-removal.diff
--- intact-loop2gate.sh	2026-09-08 04:10:08.949115475 -0600
+++ mutated-loop2gate.sh	2026-09-08 04:10:08.963798906 -0600
@@ -61,7 +61,7 @@
   out="${HOUT[$h]}"; rc="${HRC[$h]:-1}"
   # A harness that died has measured nothing, so it may not produce an `ok`
   # even if its text carries the needle. Exit code first, needle second.
-  if [ "${rc:-1}" = "0" ] && printf '%s' "$out" | grep -qE "$2"; then echo "  ok   $1"
+  if printf '%s' "$out" | grep -qE "$2"; then echo "  ok   $1"
   elif [ "${rc:-1}" != "0" ] && blocked_out "$out"; then
     echo "  BLOCKED $1 ($h could not run; nothing measured)"; blkd=1
   elif [ "${rc:-1}" != "0" ]; then echo "  FAIL $1 ($h exit $rc; wanted /$2/)"; fail=1
